# DataFrames
 
 #### Defination :- Data frames are generic data objects of R, used to store tabular data

In [26]:
v1=c(1,2,3,5,6)

In [27]:
v2=c("python","c","react","native","html")

In [28]:
v3=c("python","c","react","native","html")

In [29]:
v4=c("best","good","average","vbbhjf","fsgfds")

In [30]:
v5=c("best","good","average","vbbhjf","fsgfds")

In [31]:
df=data.frame(v1,v2,v3,v4,v5)

In [32]:
df

  v1 v2     v3     v4      v5
1 1  python python best    best
2 2  c      c      good    good
3 3  react  react  average average
4 5  native native vbbhjf  vbbhjf
5 6  html   html   fsgfds  fsgfds

In [33]:
new_df=data.frame(v1,v2,v3,v3)

In [34]:
new_df

  v1 v2     v3     v3.1
1 1  python python python
2 2  c      c      c
3 3  react  react  react
4 5  native native native
5 6  html   html   html

# Create a dataframe using data from a file

In [35]:
new_df[c(2,4)]

  v2     v3.1
1 python python
2 c      c
3 react  react
4 native native
5 html   html

# Accessing rows and Columns

In [92]:
print(df[1:3,])

  v1     v2     v3      v4      v5
1  1 python python    best    best
2  2      c      c    good    good
3  3  react  react average average

In [93]:
print(df[,1:3])

  v1     v2     v3
1  1 python python
2  2      c      c
3  3  react  react
4  5 native native
5  6   html   html

In [94]:
print(df[1,2])

[1] python
Levels: c html native python react

In [95]:
print(df[1:1,2:2])

[1] python
Levels: c html native python react


# Subset

In [96]:
pd2=data.frame("Name"=c("Ujjwal","Ujjwal","Kar","Bit"),
              "Month"=c("Jan","Feb","Mar","Feb"),
              "BS"=c(140,548,456,785),
              "BP"=c(90.5,77,89,45.00)
              )

In [97]:
pd3=subset(pd2,Name="Ujjwal" | BS==140)

In [98]:
pd3  # Not run properly  Or Output becomes the first line

  Name   Month BS  BP
1 Ujjwal Jan   140 90.5
2 Ujjwal Feb   548 77.0
3 Kar    Mar   456 89.0
4 Bit    Feb   785 45.0

In [99]:
pd2[2,2]="R"

Warning message in `[<-.factor`(`*tmp*`, iseq, value = "R"):
“invalid factor level, NA generated”

In [100]:
pd2

  Name   Month BS  BP
1 Ujjwal Jan   140 90.5
2 Ujjwal NA    548 77.0
3 Kar    Mar   456 89.0
4 Bit    Feb   785 45.0

In [101]:
myPD=data.frame()

In [102]:
myPD=edit(myPD)  # Not run in Jupyter

ERROR: Error in edit(myPD): ‘edit()’ not yet supported in the Jupyter R kernel

In [103]:
pd4=rbind(pd2,data.frame(Name="Absb",Month=9,BS=44.5,BP=80.9659))

Warning message in `[<-.factor`(`*tmp*`, ri, value = 9):
“invalid factor level, NA generated”

In [104]:
pd4

  Name   Month BS    BP
1 Ujjwal Jan   140.0 90.5000
2 Ujjwal NA    548.0 77.0000
3 Kar    Mar   456.0 89.0000
4 Bit    Feb   785.0 45.0000
5 Absb   NA     44.5 80.9659

In [105]:
pd5=cbind(pd4,NEW=c(10,12,18,17,15))

In [106]:
pd5

  Name   Month BS    BP      NEW
1 Ujjwal Jan   140.0 90.5000 10
2 Ujjwal NA    548.0 77.0000 12
3 Kar    Mar   456.0 89.0000 18
4 Bit    Feb   785.0 45.0000 17
5 Absb   NA     44.5 80.9659 15

In [107]:
pd6=pd5[-2,-3]  # Delete

In [108]:
pd6

  Name   Month BP      NEW
1 Ujjwal Jan   90.5000 10
3 Kar    Mar   89.0000 18
4 Bit    Feb   45.0000 17
5 Absb   NA    80.9659 15

In [109]:
pd7=pd6[,!names(pd6)%in%c("NEW")]

In [110]:
pd7

  Name   Month BP
1 Ujjwal Jan   90.5000
3 Kar    Mar   89.0000
4 Bit    Feb   45.0000
5 Absb   NA    80.9659

In [111]:
pd7[1,1]="jhgcghchgv"

Warning message in `[<-.factor`(`*tmp*`, iseq, value = "jhgcghchgv"):
“invalid factor level, NA generated”

In [112]:
pd7

  Name Month BP
1 NA   Jan   90.5000
3 Kar  Mar   89.0000
4 Bit  Feb   45.0000
5 Absb NA    80.9659

In [113]:
pd7[1,3]=88

In [114]:
pd7

  Name Month BP
1 NA   Jan   88.0000
3 Kar  Mar   89.0000
4 Bit  Feb   45.0000
5 Absb NA    80.9659

In [115]:
library(reshape2)

In [116]:
df=melt(pd2,id.vars=c("Name","Month"),measure.vars=c("BS","BP"))

In [117]:
df

  Name   Month variable value
1 Ujjwal Jan   BS       140.0
2 Ujjwal NA    BS       548.0
3 Kar    Mar   BS       456.0
4 Bit    Feb   BS       785.0
5 Ujjwal Jan   BP        90.5
6 Ujjwal NA    BP        77.0
7 Kar    Mar   BP        89.0
8 Bit    Feb   BP        45.0

In [118]:
df2=melt(pd2,id.vars=c("Name"),measure.vars=c("Month","BS","BP"))

Warning message:
“attributes are not identical across measure variables; they will be dropped”

In [119]:
df2

   Name   variable value
1  Ujjwal Month    Jan
2  Ujjwal Month    NA
3  Kar    Month    Mar
4  Bit    Month    Feb
5  Ujjwal BS       140
6  Ujjwal BS       548
7  Kar    BS       456
8  Bit    BS       785
9  Ujjwal BP       90.5
10 Ujjwal BP       77
11 Kar    BP       89
12 Bit    BP       45

In [120]:
pd5

  Name   Month BS    BP      NEW
1 Ujjwal Jan   140.0 90.5000 10
2 Ujjwal NA    548.0 77.0000 12
3 Kar    Mar   456.0 89.0000 18
4 Bit    Feb   785.0 45.0000 17
5 Absb   NA     44.5 80.9659 15

In [121]:
pd5[,c(2,4)]

  Month BP
1 Jan   90.5000
2 NA    77.0000
3 Mar   89.0000
4 Feb   45.0000
5 NA    80.9659

In [122]:
DF2=dcast(df,variable+Month ~ Name,value.var="value")

In [123]:
DF2

  variable Month Bit Kar Ujjwal
1 BS       Feb   785  NA    NA
2 BS       Jan    NA  NA 140.0
3 BS       Mar    NA 456    NA
4 BS       NA     NA  NA 548.0
5 BP       Feb    45  NA    NA
6 BP       Jan    NA  NA  90.5
7 BP       Mar    NA  89    NA
8 BP       NA     NA  NA  77.0

In [124]:
2>3

[1] FALSE

In [125]:
2<3

[1] TRUE

In [126]:
5>=5

[1] TRUE

In [127]:
2==3

[1] FALSE

In [128]:
2!=3

[1] TRUE

# Matrix

In [129]:
A=matrix()
A

     [,1]
[1,] NA

In [130]:
A=matrix(c(1,2,3,4,5,6,7,8,9))
A

      [,1]
 [1,] 1
 [2,] 2
 [3,] 3
 [4,] 4
 [5,] 5
 [6,] 6
 [7,] 7
 [8,] 8
 [9,] 9

In [131]:
A=matrix(c(1,2,3,4,5,6,7,8,9),nrow=3)
A[]

     [,1] [,2] [,3]
[1,] 1    4    7
[2,] 2    5    8
[3,] 3    6    9

In [132]:
print(A[1,1:2])

[1] 1 4

In [133]:
A=matrix(c(1,2,3,4,5,6,7,8,9),nrow=3,ncol=3)
A

     [,1] [,2] [,3]
[1,] 1    4    7
[2,] 2    5    8
[3,] 3    6    9

In [134]:
A=matrix(c(1,2,3,4,5,6,7,8,9),nrow=3,ncol=3,byrow=TRUE)
A

     [,1] [,2] [,3]
[1,] 1    2    3
[2,] 4    5    6
[3,] 7    8    9

In [135]:
matrix(3,3,4)

     [,1] [,2] [,3] [,4]
[1,] 3    3    3    3
[2,] 3    3    3    3
[3,] 3    3    3    3

In [136]:
diag(c(4,5,6),3,3)

     [,1] [,2] [,3]
[1,] 4    0    0
[2,] 0    5    0
[3,] 0    0    6

In [137]:
dim(A)

[1] 3 3

In [138]:
X=9
a=(X**2+5*X+3)

In [139]:
a

[1] 129

In [140]:
C=matrix(c(1,2,3,4,5,6,7,8,9),nrow=3,ncol=3,byrow=TRUE)
apply(C,sum)

ERROR: Error in match.fun(FUN): argument "FUN" is missing, with no default

In [141]:

n=2
sum=0
for(i in 1:11){
    sum=sum+(i^2)
    if (i %% 2 !=0)
            next
    print(c(month.abb[i+1],sum))
}

[1] "Mar" "5"
[1] "May" "30"
[1] "Jul" "91"
[1] "Sep" "204"
[1] "Nov" "385"

In [142]:
print(seq(1,8,2))

[1] 1 3 5 7

In [143]:
n=8
x = seq(1,n,2)
for (i in x) {
    if (i == 5){
            print(i)
        break
}
}

[1] 5

In [22]:
library(reshape2)

In [4]:
library(dplyr)

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [5]:
NewDF1=data.frame("Name"=c("Ujjwal","Ujjwal","Kar","Bit"),
              "Month"=c("Jan","Feb","Mar","Feb"),
              "BS"=c(140,548,456,785),
              "BP"=c(90.5,77,89,45.00)
              )

In [6]:
NewDF2=data.frame("Name"=c("Ujjwal","Ujjwal","Kar","Bit"),
              "Month"=c("Jan","Feb","Mar","Feb"),
              "BS"=c(140,548,456,785),
              "New"=c(90.5,77,89,45.00)
              )

In [16]:
NewDF1

NewDF2

right_join(NewDF1,NewDF2,by="Name")

  Name   Month BS  BP
1 Ujjwal Jan   140 90.5
2 Ujjwal Feb   548 77.0
3 Kar    Mar   456 89.0
4 Bit    Feb   785 45.0

  Name   Month BS  New
1 Ujjwal Jan   140 90.5
2 Ujjwal Feb   548 77.0
3 Kar    Mar   456 89.0
4 Bit    Feb   785 45.0

  Name   Month.x BS.x BP   Month.y BS.y New
1 Ujjwal Jan     140  90.5 Jan     140  90.5
2 Ujjwal Feb     548  77.0 Jan     140  90.5
3 Ujjwal Jan     140  90.5 Feb     548  77.0
4 Ujjwal Feb     548  77.0 Feb     548  77.0
5 Kar    Mar     456  89.0 Mar     456  89.0
6 Bit    Feb     785  45.0 Feb     785  45.0

In [19]:
NewDF3=data.frame("Name"=c("Ujjwal","Ujjwal","Kar","Bit"),
              "New"=c(90.5,77,89,45.00),
              "BS"=c(140,548,456,785),
              "BP"=c(90.5,77,89,45.00)
              )

In [20]:
NewDF3

  Name   New  BS  BP
1 Ujjwal 90.5 140 90.5
2 Ujjwal 77.0 548 77.0
3 Kar    89.0 456 89.0
4 Bit    45.0 785 45.0

In [24]:
 recast(ships,type~variable,id.var=c("Name"),fun.aggregate = sum)

ERROR: Error in melt(data, id.var, measure.var): object 'ships' not found